<?php

$exist = 0;
$a = $_POST['a'];
$b = $_POST['b'];
$c = $_POST['c'];
if (($a < ($b + $c)) && ($b < ($a + $c)) && ($c < ($a + $b))) { //проверка дали съществува триъгълник
    $exist = 1;
    if ($a == $b & $b == $c) {
        echo "Тригълникът е равностранен<br>";
    }
    if ($a != $b & $a != $c & $b != $c) {
        echo "Триъгълникът е разностранен<br>";
    }
    if (($a == $b & $b != $c) || ($a == $c & $c != $b) || ($b == $c & $c != $a)) {
        echo "Триъгълникът е разностранен<br>";
    }
} else {
    echo "Не същестува такъв триъгълник.";
}